var app = new Vue({
  el: '#page',
  data: {
    网页名称: '猴猴的个人简历',
    姓名: '曾泓彰',
    号码: '17393188712',
    邮箱: '1263752452@qq.com',
    个人网页: 'www.baidu.com',
    地址: '广西壮族自治区贺州市',
    职业: '兰州交通大学动画实习生',
    头像地址: 'images/touxiang.jpg',
    /** 支持类型有[微博,qq,git,instagram]*/
    联系方式: [
      {
        类型: '微博',
        地址: 'https://weibo.com/u/5873964483/home?wvr=5'
      },
      {
        类型: 'qq',
        地址: '234'
      },
      {
        类型: 'git',
        地址: '23423'
      },
      {
        类型: 'instagram',
        地址: '234234'
      }
    ],
    关于我标题: '大家好',
    关于我内容: '我是兰州交通大学艺术设计学院动画系的一名学生，具有一定的人际交往能力，热爱学习成绩优异，爱好软件学习，主要熟悉的软件有CINEMA 4D，Ae，Pr，达芬奇，MD等',
    /** 个人简历*/
    工作经历: [
      {
        职业名称: '实习生',
        公司名称: 'ECHO回声创意工作室',
        时间: '2019年9月 - 2020年1月',
        介绍: '2019年9月在ECHO回声创意工作室与香港导演”胡易霈“合作项目《无警城市》动画系列的制作；在工作室担任侧写组组长，动作捕捉成员，三维动画动作制作成员。'
      },
      {
        职业名称: '实习生',
        公司名称: '校内',
        时间: '2020年3月 - 2020年7月',
        介绍: '参加PC端游戏类的游戏开发，通过剧本进行对游戏角色的建模，制作动画，交互设计，交互优化，实现画面的完整。最终制作出两种PC端的小游戏。'
      },
      {
        职业名称: '实习生',
        公司名称: '欢乐多工作室',
        时间: '2019年1月 - 2019年2月',
        介绍: '2019年1月份曾在家乡广西壮族自治区贺州市的欢乐多工作室参加游乐场游戏制作与策划。'
      },
    ],
    /** 教育经历*/
    教育经历: [
      {
        学段: '兰州交通大学',
        学校名称: '2017.09-2021.06',
        时间: '- 现在',
        介绍: '动画/本科'
      },
      {
        学段: '主修课程',
        学校名称: '2017.09-2021.06',
        时间: '- 现在',
        介绍: '三维动画制作，多媒体技术交互技术制作以及应用，三维角色建模、场景建模、工业产品建模，影视后期制作、视频剪辑、特效制作。'
      },
      {
        学段: '获奖经历',
        学校名称: '2017.09-2021.06',
        时间: '- 现在',
        介绍: '①参加大广赛制作义务商品吉祥物，获得省级奖励。②参加大学生。。。'
      },
    ],
    /** 我的能力 图标可以打开/fonts/demo.html看看需要什么样的图标*/
    我的能力: [
      {
        名称: 'CINEMA 4D',
        图标: 'clock2.demo',
        介绍: '可以灵活运用C4D制作角色动画，产品动画，海报，特效'
      },
      {
        名称: 'Adobe After Effects',
        图标: '学校名称',
        介绍: '可以灵活运用AE制作片头片尾，抠像，特效'
      },
      {
        名称: 'Marvelous Designer',
        图标: '学校名称',
        介绍: '可以熟练的结合MD给角色制作衣服'
      },
      {
        名称: 'Photoshop',
        图标: '学校名称',
        介绍: '很熟练的用PS处理图片'
      },
      {
        名称: 'DaVinci Resolve',
        图标: '学校名称',
        介绍: '可以灵活运用达芬奇剪辑视频，调色'
      },
      {
        名称: 'ZBrush',
        图标: '学校名称',
        介绍: '可以灵活运用ZB雕刻模型，建模'
      }
    ],
    /** 我的技能*/
    我的技能: [
      {
        名称: 'CINEMA 4D',
        进度: 90,
      },
      {
        名称: 'Marvelous Designer',
        进度: 90
      },
      {
        名称: 'DaVinci Resolve',
        进度: 80
      },
      {
        名称: 'Photoshop',
        进度: 90
      },
      {
        名称: 'Adobe Premiere Pro',
        进度: 90
      },
      {
        名称: 'Adobe After Effects',
        进度: 80
      },
      {
        名称: 'Houdini',
        进度: 30
      },
      {
        名称: 'Maya',
        进度: 60
      }
    ],
    /** 我的作品*/
    我的作品: [
      {
        名称: '《空间》',
        地址: 'https://space.bilibili.com/374870805/dynamic',
        图片: 'images/005.jpg',
        简介: '新作品'
      },
      {
        名称: '写实场景',
        地址: 'https://space.bilibili.com/374870805/dynamic',
        图片: 'images/012.jpg',
        简介: '新作品'
      },
      {
        名称: '特效',
        地址: 'https://space.bilibili.com/374870805/dynamic',
        图片: 'images/009.jpg',
        简介: '新作品'
      }, {
        名称: '《无警城市》动画系列',
        地址: 'https://weibo.com/6490421195/profile?rightmod=1&wvr=6&mod=personnumber&is_all=1',
        图片: 'images/016.jpg',
        简介: '新作品'
      }, {
        名称: '《地铁施工生长动画》',
        地址: 'https://www.bilibili.com/video/BV1xD4y1m7Dg',
        图片: 'images/017.jpg',
        简介: '新作品'
      }, {
        名称: '《三维特效合集》',
        地址: 'https://www.bilibili.com/video/BV1Ph411R7xg',
        图片: 'images/018.jpg',
        简介: '新作品'
      }, {
        名称: '《九阳榨汁机动画展示片》',
        地址: 'https://www.bilibili.com/video/BV12i4y1M7Fz',
        图片: 'images/021.jpg',
        简介: '新作品'
      }, {
        名称: '《九阳榨汁机动画宣传片》',
        地址: 'https://www.bilibili.com/video/BV1oa4y177Hu',
        图片: 'images/020.jpg',
        简介: '新作品'
      }
    ]
  },
  mounted () {
    document.title = this.网页名称
  }
})